In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as stats
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

## 1- We want to know whether men and women choose different jobs. (and if so which job)

another formualtion of the question is that is there is a relation between the gender and the job type

----
### Hypothesis testing
<pre>If I want to apply hypothesis testing, I will use the following hypothesis:
H_0->the number of women and men in each job type is equal (The ratio between male and female is 1)
H_1-> there at least one job that the number of the females and males differ (The ratio between male and female is not 1)
is it applicale ?
</pre>
    
<pre>
    - The proportion of the female and male freq(male)/freq(female)
</pre>
----

if we constructed table for each job and the number of Males and females in each job
|Job|Male|Female|
|---|---|---|
|Job1|10|20|

we can use chi-square test to test whether males and females choose different jobs or not

In [14]:
df = pd.read_csv('Glassdoor Gender Pay Gap.csv')
df.head()

,JobTitle,Gender,Age,PerfEval,Education,Dept,Seniority,BasePay,Bonus
0,Graphic Designer,Female,18,5,College,Operations,2,42363,9938
1,Software Engineer,Male,21,5,College,Management,5,108476,11128
2,Warehouse Associate,Female,19,4,PhD,Administration,5,90208,9268
3,Software Engineer,Male,20,5,Masters,Sales,4,108080,10154
4,Graphic Designer,Male,26,5,Masters,Engineering,5,99464,9319

In [15]:
df['Gender']=df['Gender'].apply(lambda x: 1 if x =='Male' else 0)
df['Male']=df['Gender'].apply(lambda x: 1 if x ==1 else 0)
df['Female']=df['Gender'].apply(lambda x: 1 if x ==0 else 0)

In [21]:
Observed=df.groupby(['JobTitle'])[['Male','Female']].sum()
Observed.reset_index(inplace=True)

In [22]:
Observed

              JobTitle  Male  Female
0       Data Scientist    54      53
1               Driver    45      46
2    Financial Analyst    58      49
3     Graphic Designer    50      48
4                   IT    46      50
5              Manager    72      18
6  Marketing Associate    11     107
7      Sales Associate    51      43
8    Software Engineer   101       8
9  Warehouse Associate    44      46